{
    "Robotics": "الروبوتات",
    "myHeader": "حيدر خلف",
    "Projects&WorkExperience": "المشاريع والخبرة العملية",

    "RoboticsDate": "فبراير 2022 - يونيو 2022",
    "FirstArticle": "ركز مشروع الروبوتات على تطوير يد روبوتية يتم التحكم بها عبر الرؤية الحاسوبية، مع دمج تقنيات التعلم الآلي ومعالجة الصور.\nتم اقتراح نهج جديد لتحسين كفاءة التحكم بحركة الأصابع المعتمد على الرؤية.\nوقد تم تقديم العمل للحصول على براءة اختراع ويجري حالياً نشره كمقال بحثي.",
    
    "SecondArticle": "في مشروع الروبوتات (فبراير 2022 – يونيو 2022)، عملت مع فريق لتطوير يد روبوتية متقدمة يتم التحكم بها باستخدام الرؤية الحاسوبية،\nمدعومة بتقنيات التعلم الآلي ومعالجة الصور. كان الهدف هو إنشاء نظام بديهي يسمح لليد الروبوتية بتقليد الإيماءات البشرية استنادًا إلى مدخلات مرئية في الوقت الفعلي.\nتركز دوري على تنفيذ خوارزميات التعلم الآلي التي تعالج البيانات المرئية من الكاميرات وتحولها إلى أوامر حركية لأصابع الروبوت.\nاستخدمنا مجموعة متنوعة من المكونات الصلبة، بما في ذلك محركات السيرفو، ووحدة تحكم Arduino، وأجهزة استشعار أخرى، لتسهيل الحركات الدقيقة والتحكم في اليد الروبوتية.\nكان دمج هذه المكونات ضروريًا لضمان حركة سلسة ودقيقة واستجابة فعالة لنظام الرؤية الحاسوبية.\nمن أبرز الابتكارات في هذا المشروع هو تقديم نهج تفاعلي جديد لتحسين كفاءة تحويل مدخلات الرؤية إلى حركات أصابع الروبوت.\nقمنا بدمج نماذج متعددة من التعلم الآلي لضمان تكامل سلس بين الكشف البصري والحركة الروبوتية، مما أدى إلى تحسين سرعة الاستجابة ودقة النظام.\nأدى المشروع إلى تقديم طلب براءة اختراع، ونحن نعمل حاليًا على إعداد مقال بحثي للنشر. وقد زودتني هذه التجربة بمعرفة عملية قيّمة في مجال الروبوتات،\nوالتحكم بمحركات السيرفو، وبرمجة Arduino، والتعلم الآلي، كما ساهمت في تعزيز مهاراتي في العمل الجماعي، وحل المشكلات، وتطبيق المهارات العملية في بيئة متعددة التخصصات.\nفيما يلي بعض مقاطع الفيديو الخاصة بالمشروع:",

    "ThirdArticle": "بالإضافة إلى تطوير المشروع، تم عرض ورقتنا البحثية حول هذا العمل في مؤتمر ISB JSB في فوكوكا 2023،\nحيث قمنا بعرض تقدمنا في مجال التحكم اليدوي الروبوتي المعتمد على الرؤية. أدناه لقطة من الورقة البحثية المنشورة.",
    
    "FourthArticle": "هذه هي الورقة البحثية التي قدمناها في مؤتمر ISB JSB في فوكوكا 2023، حيث عرضنا نهجنا للتحكم في اليد الروبوتية باستخدام الرؤية الحاسوبية والتعلم الآلي.\nسيتم مشاركة أوراق بحثية أخرى مرتبطة بهذا المشروع في المستقبل. وبما أن أعمال المؤتمر الرسمية غير متاحة حاليًا على الإنترنت،\nيمكنك الاطلاع على المجموعة الكاملة من الأوراق المنشورة من المؤتمر أدناه:",

    "Demo1": "العرض التوضيحي 1:",
    "Demo2": "العرض التوضيحي 2:",
    "Email": "البريد الإلكتروني",
    "Social": "روابط التواصل"
}
